Лицензия MIT
(неофициальный перевод — юридически действует английский текст в файле LICENSE)

Copyright (c) 2026 Goblin_Thug

Данным предоставляется безвозмездное разрешение любому лицу, получившему
копию данного программного обеспечения и сопутствующей документации
(далее — «Программное обеспечение»), использовать Программное обеспечение
без ограничений, включая без ограничения права на использование, копирование,
изменение, объединение, публикацию, распространение, сублицензирование и/или
продажу копий Программного обеспечения, а также разрешать лицам, которым
предоставляется Программное обеспечение, делать это при соблюдении
следующих условий:

Указанное выше уведомление об авторских правах и настоящее разрешение
должны быть включены во все копии или существенные части Программного
обеспечения.

ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО
ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ, ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЁННОЙ ЦЕЛИ И
НЕНАРУШЕНИЯ ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ
ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПО ИСКАМ О ВОЗМЕЩЕНИИ УЩЕРБА,
УБЫТКАМ ИЛИ ИНЫМ ТРЕБОВАНИЯМ, ВОЗНИКШИМ ИЗ ДОГОВОРА, ДЕЛИКТА ИЛИ ИНЫМ
ОБРАЗОМ В СВЯЗИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ЕГО ИСПОЛЬЗОВАНИЕМ,
ЛИБО ИНЫМИ ДЕЙСТВИЯМИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
